# Отчёт по лабораторной работе №12
## по курсу "Фундаментальная информатика"

Студент группы М8О-108Б-23 Попов Александр Дмитриевич

Работа выполнена

Преподаватель: каф. 806 Севастьянов Виктор Сергеевич

1. **Тема**: Решение задач на программирование с помощью языка C.
2. **Цель работы**: Составление простейшей программы на языке C для решения математической задачи.
3. **Задание:** По возрастанию упорядочить цифры числа попарно.
4. **Идея, метод, алгоритм решения задачи**: проверить, отрицательно ли число; посчитать количество цифр в числе, после чего создать массив с этими цифрами; отсортировать массив при помощи пузырьковой сортировки; из элементов изменённого массива получить новое число, которое и будет ответом;
5. **Сценарий выполнения работы**: Написать функцию mod для дальнейшего использования в vial_sort; добавить отдельную переменную, которая уберёт минус на время вычислений, если число отрицательно; следовать алгоритму решения залачи; тестировать программу;

| Входные данные | Выходные данные                        |
|----------------|----------------------------------------|
| 0              | 0                                      |
| 10             | 10                                     |
| -1             | -1                                     |
| -12            | -21                                    |
| 198            | 981                                    |
| 999            | 999                                    |
| -715           | -751                                   |
| 100000000002   | 210000000000                           |
| -129381283432  | -988433322211                          |
| -12121212      | -22221111                              |

6. **Протокол**:
```
#include <stdio.h>
#include <math.h>

int mod(long long int a, long long int b)
{
    long long int c = a - b * (a / b);
    return c;
}

long long int vial_sort(long long int number) {
    long long int temp = number;
    int count = 0;
    int multiplier;
    // Проверка отрицательности числа
    if(number >= 0) {
        multiplier = 1;
    } else {
        temp = temp * (-1);
        multiplier = -1;
    }
    // Подсчёт количества цифр числа
    while(temp > 0) {
        count += 1;
        temp /= 10;
    }
    // Заполнение массива цифрами числа
    long long int mass_number[count];
    temp = number * multiplier;
    for(int w = count; w >= 0; w--) {
        mass_number[w - 1] = mod(temp, 10);
        temp /= 10; 
    }
    // Пузырьковая сортировка массива
    for(int i = 0; i < count; i++) {
        for(int j = i + 1; j < count; j++) {
            if(mass_number[i] < mass_number[j]) {
                temp = mass_number[i];
                mass_number[i] = mass_number[j];
                mass_number[j] = temp;
            }
        }
    }
    // Создание числа из элементов изменённого массива
    temp = 0;
    for(int d = 0; d < count; d++) {
        temp += mass_number[d] * pow(10, count - d - 1);
    }
    if(multiplier == -1) {
        return temp * -1;
    } else {
        return temp;
    }
}

int main(void) {
    long long int number;
    scanf("%lli", &number);
    printf("%lli", vial_sort(number));
}
```
7. **Замечания автора** по существу работы: Если планируется работа с большими числами, то тип переменных обязательно должен быть long long int и в main, и в vial_sort, и в mod.
8. **Выводы**: Лабораторная работа освежила в памяти пузырьковую сортировку, которая будет полезна во множестве предстоящих задач. Было отработано написание функций, ввод и вывод данных в языке Си.
