# Отчёт по лабораторной работе №9
## по курсу "Фундаментальная информатика"

Студент группы М8О-108Б-23 Попов Александр Дмитриевич

Работа выполнена

Преподаватель: каф. 806 Севастьянов Виктор Сергеевич

1. **Тема**: Решение задач на программирование с помощью языка C.
2. **Цель работы**: Составление простейшей программы на языке C для решения математической задачи.
3. **Задание:** Выяснить, попадёт ли мяч в лунку, являющуюся пересечнием окружностей с центрами (-10; -10), (-20; - 20) и радиусом 10 за 50 шагов.
4. **Идея, метод, алгоритм решения задачи**: Начертить две окружности, (x + 10)^2 + (y + 10)^2 = 100 и (x + 20)^2 + (y+10)^2 = 100; Для выполнения условия задачи нужно, чтобы итоговые координаты мяча при подстановке в каждую окружность были меньше радиуса окружности в квадрате;
5. **Сценарий выполнения работы**: Написать функции mod, min и max для использования во время решения; в цикле, работающем до тех пор, пока время меньше 50, обновлять координаты и параметр движения по заданным в условии формулам; проверить выполнение условия попадания и вывести результат;

| Входные данные | Выходные данные                        | Описание тестируемого случая                    |
|----------------|----------------------------------------|-------------------------------------------------|
| 6              | Failure                                | Начальная координата x: 6                       |
| 27             | X coordinate: -9                       | Начальная координата y: 27                      |
| -15            | Y coordinate: -19                      | Начальный параметр движения: -15                |
|                | Movement parameter: -19                |                                                 |
|                | Time: 50                               |                                                 |
6. **Протокол**:
```
#include <stdio.h>
#include <math.h>
#include <stdbool.h>

int mod(int a, int b)
{
    int c = a - b * (a / b);
    return c;
}

int min(int a, int b, int c)
{
    int mass[3] = {a, b, c};
    for (int i = 0; i < 3; i++)
    {
        for (int j = i + 1; j < 3; j++)
        {
            if (mass[i] < mass[j])
            {
                int t = mass[i];
                mass[i] = mass[j];
                mass[j] = t;
            }
        }
    }
    return mass[2];
}

int max(int a, int b, int c)
{
    int mass[3] = {a, b, c};
    for (int i = 0; i < 3; i++)
    {
        for (int j = i + 1; j < 3; j++)
        {
            if (mass[i] < mass[j])
            {
                int t = mass[i];
                mass[i] = mass[j];
                mass[j] = t;
            }
        }
    }
    return mass[0];
}

int main(void)
{
    const int x = 6;
    const int y = 27;
    const int m = -15;
    int i = x;
    int j = y;
    int l = m;
    int k = 0;
    bool success = false;
    while (k < 50)
    {
        if ((pow(i + 10, 2) + pow(j + 10, 2) <= 100) && (pow(i + 20, 2) + pow(j + 20, 2) <= 100))
        {
            printf("Success!\n");
            printf("X coordinate: %d\n", i);
            printf("Y coordinate: %d\n", j);
            printf("Movement parameter: %d\n", l);
            printf("Time: %d\n", k);
            success = true;
            break;
        }
        int ik = i;
        int jk = j;
        int lk = l;
        i = mod(pow(ik, 3) - pow(jk, 3) + pow(lk, 3) - k, 20);
        j = mod(min(ik * jk * jk - k, pow(ik, 2) * lk - k, jk * pow(lk, 2) - k), 30);
        l = mod(max(ik * jk * jk - k, pow(ik, 2) * lk - k, jk * pow(lk, 2) - k), 30);
        k++;
    }
    if (success == false)
    {
        printf("Failure!\n");
        printf("X coordinate: %d\n", i);
        printf("Y coordinate: %d\n", j);
        printf("Movement parameter: %d\n", l);
        printf("Time: %d\n", k);
    }
}
```
7. **Замечания автора** по существу работы: Отсутствуют.
8. **Выводы**: Написаны первые функции для решения задач на языке C. Изучен синтаксис языка, и решена математическая задача.
