# Отчёт по лабораторной работе №13
## по курсу "Фундаментальная информатика"

Студент группы М8О-108Б-23 Попов Александр Дмитриевич

Работа выполнена

Преподаватель: каф. 806 Севастьянов Виктор Сергеевич

1. **Тема**: Решение задач на программирование с помощью языка Си. Множества.
2. **Цель работы**: При помощи множеств решить задачу на языке Си.
3. **Задание:** Проверить, есть согласная буква, входящая в состав всех слов.
4. **Идея, метод, алгоритм решения задачи**: Внедрить распознавание разделителей для рассмотрения отдельных слов; сформировать множество букв, входящих в слово, и пересекать его с множеством использованных согласных букв, пока считывание ввода не закончится; вывести результат;
5. **Сценарий выполнения работы**: Написать функцию char_to_set для создания множества из одной буквы; написать функцию is_sep для распознавания разделителей; объявить consonant_letters равной 66043630, что в двоичной системе включает в себя все согласные буквы; ввести множество использованных согласных букв cons_let; в цикле пересекать множество использованных согласных букв с множеством имеющихся в слове; вывести результат;

| Входные данные                                          | Выходные данные                        |
|---------------------------------------------------------|----------------------------------------|
| abcd,,,,,,cfderfgb                                      | bcd                                    |
|     ght&gjhnhkup ,,   ytu(iop, lp                       | p                                      |
| abcdefg*()_+MNY    MYa                                  | my                                     |
| abcdefghijk    lmnop                                    |                                        |

6. **Протокол**:
```
#include <stdio.h>
#include <ctype.h>

unsigned int char_to_set(char c) {
    c = tolower(c);
    if(c < 'a' || c > 'z') {
        return 0;
    } else {
        return 1u<<(c - 'a');
    }
}

int is_sep(int h){
    return (h == ' ') || (h == ',') || (h == '\t') || (h == '\n') || (h == EOF);
}

int main()
{
    unsigned int consonant_letters = 66043630;
    char alpha;
    int c;
    unsigned int letters_set = 0;
    unsigned int used_cons = consonant_letters;
    
    while((c = getchar())) {
        letters_set = letters_set | char_to_set(c);
        if(is_sep(c) == 1 && letters_set != 0) {
            used_cons = used_cons & letters_set;
            letters_set = 0;
        }
        if(c == EOF) {
            break;
        }
    }
    printf("\n");
    for(alpha = 'a'; alpha <= 'z'; alpha++) {
        if((used_cons & char_to_set(alpha)) != 0) {
            printf("%c", alpha);
        }
    }
}
```
7. **Замечания автора** по существу работы: Отсутствуют.
8. **Выводы**: Работа помогла разобраться с типом данных unsigned int и множествами, а также побитовыми операциями, что обязательно поможет в решении задач в дальнейшем;
