# Отчёт по лабораторной работе №14
## по курсу "Фундаментальная информатика"

Студент группы М8О-108Б-23 Попов Александр Дмитриевич

Работа выполнена

Преподаватель: каф. 806 Севастьянов Виктор Сергеевич

1. **Тема**: Решение задач на программирование с помощью языка C. Работа с вложенными циклами и вывод матриц.
2. **Цель работы**: Вывести вводимую матрицу определённым образом.
3. **Задание:** Вывести задаваемую матрицу по спирали.
4. **Идея, метод, алгоритм решения задачи**: после заполнения массива вывести его определённым образом при помощи вложенных циклов с переменными границами;
5. **Сценарий выполнения работы**: создать массив и заполнить его; ввести четыре переменные для контроля границ строк и столбцов и общий счётчик интераций; в циклах изменять упомянутые переменные в зависимости от "направления движения по индексам", пока счётчик итераций не будет равен порядку матрицы в квадрате;

| Входные данные | Выходные данные                        |
|----------------|----------------------------------------|
| 1 12 11 10     | 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 |
| 2 13 16 9      |                                        |
| 3 14 15 8      |                                        |
| 4 5 6 7        |                                        |

6. **Протокол**:
```
#include <stdio.h>


int main() {
    int m[100][100];

    int grade;
    scanf("%d", &grade);
    for (int i = 0; i != grade; ++i) {
        for (int j = 0; j != grade; ++j) {
            scanf("%d", &m[i][j]);
        }
    }
    int count = 1;
    int start_row = 0;
    int start_column = 0;
    int end_row = grade - 1;
    int end_column = grade - 1;
    while(count <= grade * grade){
        for(int i = start_row; i < end_row + 1; i++) {
            printf("%d ", m[i][start_column]);
            count += 1;
        }
        start_column += 1;
        
        for(int i = start_column; i < end_column + 1; i++) {
            printf("%d ", m[end_row][i]);
            count += 1;
        }
        end_row -= 1;
        
        for(int i = end_row; i > start_row - 1; i--) {
            printf("%d ", m[i][end_column]);
            count += 1;
        }
        end_column -= 1;

        for(int i = end_column; i > start_column - 1; i--) {
            printf("%d ", m[start_row][i]);
            count += 1;
        }
        start_row += 1;
    }
}
```
7. **Замечания автора** по существу работы: Отсутствуют.
8. **Выводы**: Отработаны циклы while и for с переменными границами. Также лабораторная работа улучшила понимание двумерных массивов, работа с которыми предстоит в ЛР №15.
